Revit 2027 API
ParameterTypeId.CurveSupportOffset Property
 "Wall offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveSupportOffset { get; }
Public Shared ReadOnly Property CurveSupportOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveSupportOffset {
	ForgeTypeId^ get ();
}
static member CurveSupportOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace